---
kind: type
id: T:Autodesk.Revit.DB.ImageView
source: html/d81ffc17-044c-2671-c2f1-374e1dd90c53.htm
---
# Autodesk.Revit.DB.ImageView

Class for ImageView views

## Syntax (C#)
```csharp
public class ImageView : ViewDrafting
```